// <-------- კალკულატორი -------#### //

/*
    აქ უნდა შევქმნათ კალკულატორი იუზერისთვის,
    თავიდან იუზერს, prompt-ით უნდა ჩააწერინოთ ხუთი რიცხვი(და იფებით უნდა დაჩეკოთ ნამდვილად ჩაწერა თუ არა რიცხვი)
    მაგ ხუთი რიცხვის შემდეგ უნდა ჩააწერინოთ რა არითმეტიკული მოქმედება გააკეთოს ჩვენმა კალკულატორმა,
    (აქ შეუძლია ჩაწეროს მარტო '-','+','*' თუ სხვა რამეს ჩაწერს ახლიდან ამოუგდეთ სანამ არ ჩაწერს ამ სამიდან ერთ-ერთს)
    ამ პრომპტებიდან ხუთი მიღებული რიცხვი უნდა ჩასეტოთ მასივში და ერთ ცვლადში უნდა გქონდეთ რა არითმეტიკული მოქმედება უნდა ჩავატაროთ(რაც იუზერი აარჩევს).
    შემდეგ უნდა შექმნათ ფუნქცია რმელიც მიიღებს 2 პარამეტრს პირვილი იქნება მასივი და მეორე არითმეტიკული მოქმედება, და მაგ ფუნქციამ არითმეტიკული მნიშვნელობის მიხედვით უნდა
    გააკეთოს გამოთვლა თუ '+' არის უნდა ყველა მასივის ელემენტი მიამატოს ერთმანეთს(მაგ. 1 + 2 + 3 + 4 + 5) თუ "*" გაამრავლოს (მაგ. 1 * 2 * 3 * 4 * 5)
*/

////// =>> კოდი დაწერეთ აქ

let arr = [];

    arr.push(prompt('ჩაწერე პირველი რიცხვი'));
    arr.push(prompt('ჩაწერე მეორე რიცხვი'));
    arr.push(prompt('ჩაწერე მესამე რიცხვი'));
    arr.push(prompt('ჩაწერე მეოთხე რიცხვი'));
    arr.push(prompt('ჩაწერე მეხუთე რიცხვი'));
    let simbol = (prompt ('ჩაწერე +, -, * რომელიმე სიმბოლო'));
    alert (arr[0]+simbol+arr[1]+simbol+arr[2]+simbol+arr[3]+simbol+arr[4]);
    
    alert(func(arr,simbol));
    function func (par1, par2){
        switch (par2){
            case '+': 
            return parseInt(par1[0])+parseInt(par1[1])+parseInt(par1[2])+parseInt(par1[3])+parseInt(par1[4]);
            case '-': 
            return parseInt(par1[0])-parseInt(par1[1])-parseInt(par1[2])-parseInt(par1[3])-parseInt(par1[4]);
            case '*': 
            return parseInt(par1[0])*parseInt(par1[1])*parseInt(par1[2])*parseInt(par1[3])*parseInt(par1[4]);
        }
    }

//////



// <-------- თანაკვეთა -------#### //

/*
    თქვენი დავალებაა შექმნათ ფუნცქცია რომელიც აბრუნებს ახალ მასივს, მასივი კი შედგება ამ ორი მასივის თანაკვეთისგან (რომელსაც ორივე შეიცავს)
    შექმენით ორი მასივი და გამოიყენეთ იგივე ფუნქცია რომ იპოვოთ ამ ორი მასივის თანანაკვეთა
*/

const Arr1 = [1, 23, 3, 34, 54, 6];
const Arr2 = [23, 3, 123, 34, 43, 4, 41]

////// =>> კოდი დაწერეთ აქ

alert (collide(Arr1, Arr2));

function collide (par1, par2){
    const Arr3 = [];
    for (let i=0; i<6; i++){
        for (let j=0; j<7; j++){
            if (par1 [i] == par2[j])
              Arr3.push (par1[i]);
        }
    }
    return Arr3;
}

//////



// <-------- ასინქრონული ფუნქცია -------#### //

/**
 * შექმენით ასინქრონული ფუნქცია რომელიც დაითვლის ათამდე, 10 წამის განმავლობაში (1++ == 1წმ)
 */


////// =>> კოდი დაწერეთ აქ

function timer(a){
    console.log(a)
    a++
    if( a > 0 && a < 11){
        setTimeout(() => timer(a),1000)
    }
}
 timer(1) 

//////



// <-------- უდიდესი რიცხვი -------#### //

/**
 * შექმენით ისეთი ფუნქცია რომელიც დაგიბრუნებთ მიწოდებული მასივის უდიდეს რიცხვს
 */


////// =>> კოდი დაწერეთ აქ

const Arr= [2, 4, 9, 1, 14, 93, 123, 9, 14, 14, 23];
    function max (par1){
        let max = (par1[0]);
        for (let i=0; i<par1.length; i++ ){
            if (par1[i]>max)
            max=par1[i];
        } 
        return max;
    }
    alert (max(Arr));

//////



// <-------- პროცენტის გამოთვლა -------#### //

/**
 *  ჩვენ ვაკეთებთ პროგრამას ბანკისთვის სადაც ადამიანს ვთავაზობთ შეიყვანოს თანხა და დროის ოდენობა (თვეში). 
 *  პროცენტი თვეების მიხედვით: 1-6 თვემდე 10%, 6-12 თვემდე 14%, 1წელზე ზემოთ 20%
 *  გამოთვალეთ სულ რამდენი იქნება გადასახდელი პროცენტთან ერთად.
 */

////// =>> კოდი დაწერეთ აქ

function banki (a,b){
    if (b<=6)
    return (a*1.1).toFixed(2);
    else if (b<=12)
    return (a*1.14).toFixed(2);
    else 
    return (a*1.2).toFixed(2);
}
let a = prompt ('შეიყვანე თანხა');
let b = prompt ('შეიყვანე თვეების რაოდენობა');
alert (banki (a, b ));

//////